
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: DP1Project
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_07.BP_HugeMapWall_07_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_07_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_06.BP_HugeMapWall_06_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_06_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_01.BP_HugeMapWall_01_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_01_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_05.BP_HugeMapWall_05_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_05_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_04.BP_HugeMapWall_04_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_04_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_02.BP_HugeMapWall_02_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_02_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_03.BP_HugeMapWall_03_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_03_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/wall/BP_HugeMapWall_00.BP_HugeMapWall_00_C
/// Size: 0x02B0 (688 bytes) (0x0002A8 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_HugeMapWall_00_C : public AMapActorBase
{ 
public:
	class UGameStaticMeshComponent*                    GameStaticMesh;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Level/Map/Map_200000/Map.Map_C
/// Size: 0x02B0 (688 bytes) (0x000298 - 0x0002B0) align 8 MaxSize: 0x02B0
class AMap_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	SDK_UNDEFINED(16,1148) /* TArray<TEnumAsByte<EObjectTypeQuery>> */ __um(Object_Types);                         // 0x02A0   (0x0010)  


	/// Functions
	// Function /Game/Level/Map/Map_200000/Map.Map_C.ExecuteUbergraph_Map
	// void ExecuteUbergraph_Map(int32_t EntryPoint);                                                                           // [0x35d7f00] Final                
};

#pragma pack(pop)


