
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimationCore
/// dependency: ControlRig
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: RigVM

#pragma pack(push, 0x1)

/// Struct /Engine/Transient.ChaosDestructionEvent_SWC
/// Size: 0x0044 (68 bytes) (0x000000 - 0x000044) align 4 MaxSize: 0x0044
struct FChaosDestructionEvent_SWC
{ 
	FVector3f                                          Position;                                                   // 0x0000   (0x000C)  
	FVector3f                                          Normal;                                                     // 0x000C   (0x000C)  
	FVector3f                                          Velocity;                                                   // 0x0018   (0x000C)  
	FVector3f                                          AngularVelocity;                                            // 0x0024   (0x000C)  
	float                                              ExtentMin;                                                  // 0x0030   (0x0004)  
	float                                              ExtentMax;                                                  // 0x0034   (0x0004)  
	int32_t                                            ParticleID;                                                 // 0x0038   (0x0004)  
	float                                              Time;                                                       // 0x003C   (0x0004)  
	int32_t                                            Type;                                                       // 0x0040   (0x0004)  
};

/// Struct /Engine/Transient.PropertyBag_4ce609113f77fdd
/// Size: 0x13FC (5116 bytes) (0x000000 - 0x0013FC) align 16 MaxSize: 0x13FC
struct FPropertyBag_4ce609113f77fdd
{ 
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_Item__Const;              // 0x0000   (0x000C)  
	ERigVMTransformSpace                               RigVMModel___RigUnit_SetTransform_Space__Const;             // 0x000C   (0x0001)  
	bool                                               RigVMModel___RigUnit_SetTransform_bInitial__Const;          // 0x000D   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000E   (0x0002)  MISSED
	FRigElementKey                                     RigVMModel___RigUnit_GetTransform_Item__Const;              // 0x0010   (0x000C)  
	float                                              RigVMModel___RigUnit_SetTransform_Weight__Const;            // 0x001C   (0x0004)  
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_1_Item__Const;            // 0x0020   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_GetTransform_1_Item__Const;            // 0x002C   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_2_Item__Const;            // 0x0038   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_GetTransform_2_Item__Const;            // 0x0044   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_1_1_Item__Const;          // 0x0050   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_GetTransform_1_1_Item__Const;          // 0x005C   (0x000C)  
	bool                                               RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_5_Condition__Const; // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0069   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel_Rig_2___ParentConstraint_Child__Const;           // 0x006C   (0x000C)  
	FTransformFilter                                   RigVMModel_Rig_2___ParentConstraint_Filter__Const;          // 0x0078   (0x0009)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0081   (0x0007)  MISSED
	TArray<FConstraintParent>                          RigVMModel_Rig_2___ParentConstraint_Parents__Const;         // 0x0088   (0x0010)  
	FRigUnit_ParentConstraint_AdvancedSettings         RigVMModel_Rig_2___ParentConstraint_AdvancedSettings__Const; // 0x0098   (0x0002)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x009A   (0x0002)  MISSED
	FRigElementKey                                     RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_Child__Const; // 0x009C   (0x000C)  
	FFilterOptionPerAxis                               RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_Filter__Const; // 0x00A8   (0x0003)  
	unsigned char                                      UnknownData04_6[0x5];                                       // 0x00AB   (0x0005)  MISSED
	TArray<FConstraintParent>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_Parents__Const; // 0x00B0   (0x0010)  
	FRigUnit_RotationConstraint_AdvancedSettings       RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const; // 0x00C0   (0x0002)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x00C2   (0x0002)  MISSED
	FRigElementKey                                     RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_Child__Const; // 0x00C4   (0x000C)  
	TArray<FConstraintParent>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_Parents__Const; // 0x00D0   (0x0010)  
	TArray<FConstraintParent>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_1_Parents__Const; // 0x00E0   (0x0010)  
	TArray<FConstraintParent>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_Parents__Const; // 0x00F0   (0x0010)  
	ERigUnitDebugTransformMode                         RigVMModel_Rig_2___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0100   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0101   (0x0003)  MISSED
	FLinearColor                                       RigVMModel_Rig_2___RigVMFunction_DebugTransformMutableNoSpace_Color__Const; // 0x0104   (0x0010)  
	float                                              RigVMModel_Rig_2___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const; // 0x0114   (0x0004)  
	float                                              RigVMModel_Rig_2___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0118   (0x0004)  
	unsigned char                                      UnknownData07_6[0x4];                                       // 0x011C   (0x0004)  MISSED
	FTransform                                         RigVMModel_Rig_2___RigVMFunction_DebugTransformMutableNoSpace_WorldOffset__Const; // 0x0120   (0x0060)  
	FName                                              RigVMModel_Rig_2___VariableNode_12_Value__Const;            // 0x0180   (0x0008)  
	FName                                              RigVMModel_Rig_2___VariableNode_13_Value__Const;            // 0x0188   (0x0008)  
	FName                                              RigVMModel_Rig_2___VariableNode_15_Value__Const;            // 0x0190   (0x0008)  
	FName                                              R;                                                          // 0x0198   (0x0008)  
	bool                                               L;                                                          // 0x01A0   (0x0001)  
	unsigned char                                      UnknownData08_6[0x3];                                       // 0x01A1   (0x0003)  MISSED
	FName                                              L0;                                                         // 0x01A4   (0x0008)  
	FName                                              L1;                                                         // 0x01AC   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_;                                        // 0x01B4   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_2;                                       // 0x01BC   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_3;                                       // 0x01C4   (0x0008)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_4;                                       // 0x01CC   (0x000C)  
	ERigVMTransformSpace                               MR___0_0_0_0n0_c_R_5;                                       // 0x01D8   (0x0001)  
	bool                                               MR___0_0_0_0n0_c_R_6;                                       // 0x01D9   (0x0001)  
	unsigned char                                      UnknownData09_6[0x6];                                       // 0x01DA   (0x0006)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_7;                                       // 0x01E0   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_8;                                       // 0x0240   (0x000C)  
	float                                              MR___0_0_0_0n0_c_R_9;                                       // 0x024C   (0x0004)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_10;                                      // 0x0250   (0x000C)  
	unsigned char                                      UnknownData10_6[0x4];                                       // 0x025C   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_11;                                      // 0x0260   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_12;                                      // 0x02A8   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_13;                                      // 0x02C0   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_14;                                      // 0x0308   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_15;                                      // 0x0320   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_16;                                      // 0x0328   (0x0008)  
	FRigUnit_AimBone_DebugSettings                     MR___0_0_0_0n0_c_R_17;                                      // 0x0330   (0x0070)  
	FVector                                            MR___0_0_0_0n0_c_R_18;                                      // 0x03A0   (0x0018)  
	FRigElementKey                                     __n0_V_____0___Q_;                                          // 0x03B8   (0x000C)  
	FName                                              __n0_V_____0___Q_19;                                        // 0x03C4   (0x0008)  
	FName                                              __n0_V_____0___Q_20;                                        // 0x03CC   (0x0008)  
	ERigVMTransformSpace                               __n0_V_____0___Q_21;                                        // 0x03D4   (0x0001)  
	bool                                               __n0_V_____0___Q_22;                                        // 0x03D5   (0x0001)  
	unsigned char                                      UnknownData11_6[0x2];                                       // 0x03D6   (0x0002)  MISSED
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_23;                                        // 0x03D8   (0x0048)  
	FRigElementKey                                     __n0_V_____0___Q_24;                                        // 0x0420   (0x000C)  
	FName                                              __n0_V_____0___Q_25;                                        // 0x042C   (0x0008)  
	FName                                              __n0_V_____0___Q_26;                                        // 0x0434   (0x0008)  
	FName                                              __n0_V_____0___Q_27;                                        // 0x043C   (0x0008)  
	unsigned char                                      UnknownData12_6[0x4];                                       // 0x0444   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_28;                                        // 0x0448   (0x0048)  
	FTransform                                         __n0_V_____0___Q_29;                                        // 0x0490   (0x0060)  
	bool                                               __n0_V_____0___Q_30;                                        // 0x04F0   (0x0001)  
	unsigned char                                      UnknownData13_6[0x7];                                       // 0x04F1   (0x0007)  MISSED
	FVector                                            __n0_V_____0___Q_31;                                        // 0x04F8   (0x0018)  
	FVector                                            __n0_V_____0___Q_32;                                        // 0x0510   (0x0018)  
	TArray<FConstraintParent>                          __n0_V_____0___Q_33;                                        // 0x0528   (0x0010)  
	FRigUnit_ParentConstraintMath_AdvancedSettings     __n0_V_____0___Q_34;                                        // 0x0538   (0x0001)  
	unsigned char                                      UnknownData14_6[0x3];                                       // 0x0539   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_35;                                        // 0x053C   (0x0004)  
	FRigUnit_AimBone_DebugSettings                     __n0_V_____0___Q_36;                                        // 0x0540   (0x0070)  
	EEulerRotationOrder                                __n0_V_____0___Q_37;                                        // 0x05B0   (0x0001)  
	unsigned char                                      UnknownData15_6[0x3];                                       // 0x05B1   (0x0003)  MISSED
	FRigElementKey                                     __n0_V_____0___Q_38;                                        // 0x05B4   (0x000C)  
	FName                                              __n0_V_____0___Q_39;                                        // 0x05C0   (0x0008)  
	FName                                              __n0_V_____0___Q_40;                                        // 0x05C8   (0x0008)  
	EEulerRotationOrder                                __n0_V_____0___Q_41;                                        // 0x05D0   (0x0001)  
	bool                                               MR___0_0_0_0n0_c_R_42;                                      // 0x05D1   (0x0001)  
	unsigned char                                      UnknownData16_6[0x2];                                       // 0x05D2   (0x0002)  MISSED
	FRigElementKey                                     __n0_V_____0___Q_43;                                        // 0x05D4   (0x000C)  
	FName                                              __n0_V_____0___Q_44;                                        // 0x05E0   (0x0008)  
	FName                                              __n0_V_____0___Q_45;                                        // 0x05E8   (0x0008)  
	ERigVMTransformSpace                               __n0_V_____0___Q_46;                                        // 0x05F0   (0x0001)  
	bool                                               __n0_V_____0___Q_47;                                        // 0x05F1   (0x0001)  
	unsigned char                                      UnknownData17_6[0x6];                                       // 0x05F2   (0x0006)  MISSED
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_48;                                        // 0x05F8   (0x0048)  
	FRigElementKey                                     __n0_V_____0___Q_49;                                        // 0x0640   (0x000C)  
	FName                                              __n0_V_____0___Q_50;                                        // 0x064C   (0x0008)  
	FName                                              __n0_V_____0___Q_51;                                        // 0x0654   (0x0008)  
	FName                                              __n0_V_____0___Q_52;                                        // 0x065C   (0x0008)  
	unsigned char                                      UnknownData18_6[0x4];                                       // 0x0664   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_53;                                        // 0x0668   (0x0048)  
	FTransform                                         __n0_V_____0___Q_54;                                        // 0x06B0   (0x0060)  
	bool                                               __n0_V_____0___Q_55;                                        // 0x0710   (0x0001)  
	unsigned char                                      UnknownData19_6[0x7];                                       // 0x0711   (0x0007)  MISSED
	FVector                                            __n0_V_____0___Q_56;                                        // 0x0718   (0x0018)  
	FVector                                            __n0_V_____0___Q_57;                                        // 0x0730   (0x0018)  
	TArray<FConstraintParent>                          __n0_V_____0___Q_58;                                        // 0x0748   (0x0010)  
	FRigUnit_ParentConstraintMath_AdvancedSettings     __n0_V_____0___Q_59;                                        // 0x0758   (0x0001)  
	unsigned char                                      UnknownData20_6[0x3];                                       // 0x0759   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_60;                                        // 0x075C   (0x0004)  
	FRigUnit_AimBone_DebugSettings                     __n0_V_____0___Q_61;                                        // 0x0760   (0x0070)  
	EEulerRotationOrder                                __n0_V_____0___Q_62;                                        // 0x07D0   (0x0001)  
	unsigned char                                      UnknownData21_6[0x3];                                       // 0x07D1   (0x0003)  MISSED
	FRigElementKey                                     __n0_V_____0___Q_63;                                        // 0x07D4   (0x000C)  
	FName                                              __n0_V_____0___Q_64;                                        // 0x07E0   (0x0008)  
	FName                                              __n0_V_____0___Q_65;                                        // 0x07E8   (0x0008)  
	EEulerRotationOrder                                __n0_V_____0___Q_66;                                        // 0x07F0   (0x0001)  
	unsigned char                                      UnknownData22_6[0x7];                                       // 0x07F1   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_67;                                      // 0x07F8   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_68;                                      // 0x0800   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_69;                                      // 0x0808   (0x0008)  
	FRuntimeFloatCurve                                 MR___0_0_0_0n0_c_R_70;                                      // 0x0810   (0x0088)  
	float                                              MR___0_0_0_0n0_c_R_71;                                      // 0x0898   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_72;                                      // 0x089C   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_73;                                      // 0x08A0   (0x0004)  
	FRigElementKey                                     p_n0_V__k0_0_0_____b6R_;                                    // 0x08A4   (0x000C)  
	ERigVMTransformSpace                               p_n0_V__k0_0_0_____b6R_74;                                  // 0x08B0   (0x0001)  
	bool                                               p_n0_V__k0_0_0_____b6R_75;                                  // 0x08B1   (0x0001)  
	unsigned char                                      UnknownData23_6[0x6];                                       // 0x08B2   (0x0006)  MISSED
	FVector                                            p_n0_V__k0_0_0_____b6R_76;                                  // 0x08B8   (0x0018)  
	bool                                               p_n0_V__k0_0_0_____b6R_77;                                  // 0x08D0   (0x0001)  
	unsigned char                                      UnknownData24_6[0x7];                                       // 0x08D1   (0x0007)  MISSED
	double                                             p_n0_V__k0_0_0_____b6R_78;                                  // 0x08D8   (0x0008)  
	double                                             p_n0_V__k0_0_0_____b6R_79;                                  // 0x08E0   (0x0008)  
	double                                             p_n0_V__k0_0_0_____b6R_80;                                  // 0x08E8   (0x0008)  
	EEulerRotationOrder                                MR___0_0_0_0n0_c_R_81;                                      // 0x08F0   (0x0001)  
	unsigned char                                      UnknownData25_6[0x3];                                       // 0x08F1   (0x0003)  MISSED
	FRigElementKey                                     MR___0_0_0_0n0_c_R_82;                                      // 0x08F4   (0x000C)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_83;                                      // 0x0900   (0x000C)  
	float                                              MR___0_0_0_0n0_c_R_84;                                      // 0x090C   (0x0004)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_85;                                      // 0x0910   (0x0048)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_86;                                      // 0x0958   (0x0048)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_87;                                      // 0x09A0   (0x000C)  
	unsigned char                                      UnknownData26_6[0x4];                                       // 0x09AC   (0x0004)  MISSED
	FVector                                            MR___0_0_0_0n0_c_R_88;                                      // 0x09B0   (0x0018)  
	EEulerRotationOrder                                MR___0_0_0_0n0_c_R_89;                                      // 0x09C8   (0x0001)  
	FFilterOptionPerAxis                               MR___0_0_0_0n0_c_R_90;                                      // 0x09C9   (0x0003)  
	unsigned char                                      UnknownData27_6[0x4];                                       // 0x09CC   (0x0004)  MISSED
	TArray<FConstraintParent>                          MR___0_0_0_0n0_c_R_91;                                      // 0x09D0   (0x0010)  
	FRigUnit_RotationConstraint_AdvancedSettings       MR___0_0_0_0n0_c_R_92;                                      // 0x09E0   (0x0002)  
	ERigUnitDebugTransformMode                         MR___0_0_0_0n0_c_R_93;                                      // 0x09E2   (0x0001)  
	unsigned char                                      UnknownData28_6[0x1];                                       // 0x09E3   (0x0001)  MISSED
	FLinearColor                                       MR___0_0_0_0n0_c_R_94;                                      // 0x09E4   (0x0010)  
	float                                              MR___0_0_0_0n0_c_R_95;                                      // 0x09F4   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_96;                                      // 0x09F8   (0x0004)  
	FName                                              R97;                                                        // 0x09FC   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_98;                                      // 0x0A04   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_99;                                      // 0x0A0C   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_100;                                     // 0x0A14   (0x0008)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_101;                                     // 0x0A1C   (0x000C)  
	ERigVMTransformSpace                               MR___0_0_0_0n0_c_R_102;                                     // 0x0A28   (0x0001)  
	bool                                               MR___0_0_0_0n0_c_R_103;                                     // 0x0A29   (0x0001)  
	unsigned char                                      UnknownData29_6[0x6];                                       // 0x0A2A   (0x0006)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_104;                                     // 0x0A30   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_105;                                     // 0x0A90   (0x000C)  
	float                                              MR___0_0_0_0n0_c_R_106;                                     // 0x0A9C   (0x0004)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_107;                                     // 0x0AA0   (0x000C)  
	unsigned char                                      UnknownData30_6[0x4];                                       // 0x0AAC   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_108;                                     // 0x0AB0   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_109;                                     // 0x0AF8   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_110;                                     // 0x0B10   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_111;                                     // 0x0B58   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_112;                                     // 0x0B70   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_113;                                     // 0x0B78   (0x0008)  
	FRigUnit_AimBone_DebugSettings                     MR___0_0_0_0n0_c_R_114;                                     // 0x0B80   (0x0070)  
	FVector                                            MR___0_0_0_0n0_c_R_115;                                     // 0x0BF0   (0x0018)  
	bool                                               MR___0_0_0_0n0_c_R_116;                                     // 0x0C08   (0x0001)  
	unsigned char                                      UnknownData31_6[0x7];                                       // 0x0C09   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_117;                                     // 0x0C10   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_118;                                     // 0x0C18   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_119;                                     // 0x0C20   (0x0008)  
	FRuntimeFloatCurve                                 MR___0_0_0_0n0_c_R_120;                                     // 0x0C28   (0x0088)  
	float                                              MR___0_0_0_0n0_c_R_121;                                     // 0x0CB0   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_122;                                     // 0x0CB4   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_123;                                     // 0x0CB8   (0x0004)  
	EEulerRotationOrder                                MR___0_0_0_0n0_c_R_124;                                     // 0x0CBC   (0x0001)  
	unsigned char                                      UnknownData32_6[0x3];                                       // 0x0CBD   (0x0003)  MISSED
	FRigElementKey                                     MR___0_0_0_0n0_c_R_125;                                     // 0x0CC0   (0x000C)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_126;                                     // 0x0CCC   (0x000C)  
	float                                              MR___0_0_0_0n0_c_R_127;                                     // 0x0CD8   (0x0004)  
	unsigned char                                      UnknownData33_6[0x4];                                       // 0x0CDC   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_128;                                     // 0x0CE0   (0x0048)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_129;                                     // 0x0D28   (0x0048)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_130;                                     // 0x0D70   (0x000C)  
	unsigned char                                      UnknownData34_6[0x4];                                       // 0x0D7C   (0x0004)  MISSED
	FVector                                            MR___0_0_0_0n0_c_R_131;                                     // 0x0D80   (0x0018)  
	EEulerRotationOrder                                MR___0_0_0_0n0_c_R_132;                                     // 0x0D98   (0x0001)  
	FFilterOptionPerAxis                               MR___0_0_0_0n0_c_R_133;                                     // 0x0D99   (0x0003)  
	unsigned char                                      UnknownData35_6[0x4];                                       // 0x0D9C   (0x0004)  MISSED
	TArray<FConstraintParent>                          MR___0_0_0_0n0_c_R_134;                                     // 0x0DA0   (0x0010)  
	FRigUnit_RotationConstraint_AdvancedSettings       MR___0_0_0_0n0_c_R_135;                                     // 0x0DB0   (0x0002)  
	ERigUnitDebugTransformMode                         MR___0_0_0_0n0_c_R_136;                                     // 0x0DB2   (0x0001)  
	unsigned char                                      UnknownData36_6[0x1];                                       // 0x0DB3   (0x0001)  MISSED
	FLinearColor                                       MR___0_0_0_0n0_c_R_137;                                     // 0x0DB4   (0x0010)  
	float                                              MR___0_0_0_0n0_c_R_138;                                     // 0x0DC4   (0x0004)  
	float                                              MR___0_0_0_0n0_c_R_139;                                     // 0x0DC8   (0x0004)  
	FName                                              R140;                                                       // 0x0DCC   (0x0008)  
	unsigned char                                      UnknownData37_6[0x4];                                       // 0x0DD4   (0x0004)  MISSED
	FVector                                            R141;                                                       // 0x0DD8   (0x0018)  
	bool                                               L142;                                                       // 0x0DF0   (0x0001)  
	unsigned char                                      UnknownData38_6[0x3];                                       // 0x0DF1   (0x0003)  MISSED
	FName                                              L143;                                                       // 0x0DF4   (0x0008)  
	FName                                              L144;                                                       // 0x0DFC   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_;                                        // 0x0E04   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_145;                                     // 0x0E0C   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_146;                                     // 0x0E14   (0x0008)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_147;                                     // 0x0E1C   (0x000C)  
	ERigVMTransformSpace                               ___S_0_0_0_0n0_c_R_148;                                     // 0x0E28   (0x0001)  
	bool                                               ___S_0_0_0_0n0_c_R_149;                                     // 0x0E29   (0x0001)  
	unsigned char                                      UnknownData39_6[0x6];                                       // 0x0E2A   (0x0006)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_150;                                     // 0x0E30   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_151;                                     // 0x0E90   (0x000C)  
	float                                              ___S_0_0_0_0n0_c_R_152;                                     // 0x0E9C   (0x0004)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_153;                                     // 0x0EA0   (0x000C)  
	unsigned char                                      UnknownData40_6[0x4];                                       // 0x0EAC   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_154;                                     // 0x0EB0   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_155;                                     // 0x0EF8   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_156;                                     // 0x0F10   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_157;                                     // 0x0F58   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_158;                                     // 0x0F70   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_159;                                     // 0x0F78   (0x0008)  
	FRigUnit_AimBone_DebugSettings                     ___S_0_0_0_0n0_c_R_160;                                     // 0x0F80   (0x0070)  
	FVector                                            ___S_0_0_0_0n0_c_R_161;                                     // 0x0FF0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_162;                                     // 0x1008   (0x0008)  
	FRuntimeFloatCurve                                 ___S_0_0_0_0n0_c_R_163;                                     // 0x1010   (0x0088)  
	float                                              ___S_0_0_0_0n0_c_R_164;                                     // 0x1098   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_165;                                     // 0x109C   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_166;                                     // 0x10A0   (0x0004)  
	unsigned char                                      UnknownData41_6[0x4];                                       // 0x10A4   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_167;                                     // 0x10A8   (0x0008)  
	EEulerRotationOrder                                ___S_0_0_0_0n0_c_R_168;                                     // 0x10B0   (0x0001)  
	unsigned char                                      UnknownData42_6[0x7];                                       // 0x10B1   (0x0007)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_169;                                     // 0x10B8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_170;                                     // 0x10C0   (0x0008)  
	FFilterOptionPerAxis                               ___S_0_0_0_0n0_c_R_171;                                     // 0x10C8   (0x0003)  
	unsigned char                                      UnknownData43_6[0x5];                                       // 0x10CB   (0x0005)  MISSED
	TArray<FConstraintParent>                          ___S_0_0_0_0n0_c_R_172;                                     // 0x10D0   (0x0010)  
	FRigUnit_RotationConstraint_AdvancedSettings       ___S_0_0_0_0n0_c_R_173;                                     // 0x10E0   (0x0002)  
	bool                                               ___S_0_0_0_0n0_c_R_174;                                     // 0x10E2   (0x0001)  
	ERigUnitDebugTransformMode                         ___S_0_0_0_0n0_c_R_175;                                     // 0x10E3   (0x0001)  
	FLinearColor                                       ___S_0_0_0_0n0_c_R_176;                                     // 0x10E4   (0x0010)  
	float                                              ___S_0_0_0_0n0_c_R_177;                                     // 0x10F4   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_178;                                     // 0x10F8   (0x0004)  
	FName                                              R179;                                                       // 0x10FC   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_180;                                     // 0x1104   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_181;                                     // 0x110C   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_182;                                     // 0x1114   (0x0008)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_183;                                     // 0x111C   (0x000C)  
	ERigVMTransformSpace                               ___S_0_0_0_0n0_c_R_184;                                     // 0x1128   (0x0001)  
	bool                                               ___S_0_0_0_0n0_c_R_185;                                     // 0x1129   (0x0001)  
	unsigned char                                      UnknownData44_6[0x6];                                       // 0x112A   (0x0006)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_186;                                     // 0x1130   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_187;                                     // 0x1190   (0x000C)  
	float                                              ___S_0_0_0_0n0_c_R_188;                                     // 0x119C   (0x0004)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_189;                                     // 0x11A0   (0x000C)  
	unsigned char                                      UnknownData45_6[0x4];                                       // 0x11AC   (0x0004)  MISSED
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_190;                                     // 0x11B0   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_191;                                     // 0x11F8   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_192;                                     // 0x1210   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_193;                                     // 0x1258   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_194;                                     // 0x1270   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_195;                                     // 0x1278   (0x0008)  
	FRigUnit_AimBone_DebugSettings                     ___S_0_0_0_0n0_c_R_196;                                     // 0x1280   (0x0070)  
	FVector                                            ___S_0_0_0_0n0_c_R_197;                                     // 0x12F0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_198;                                     // 0x1308   (0x0008)  
	FRuntimeFloatCurve                                 ___S_0_0_0_0n0_c_R_199;                                     // 0x1310   (0x0088)  
	float                                              ___S_0_0_0_0n0_c_R_200;                                     // 0x1398   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_201;                                     // 0x139C   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_202;                                     // 0x13A0   (0x0004)  
	unsigned char                                      UnknownData46_6[0x4];                                       // 0x13A4   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_203;                                     // 0x13A8   (0x0008)  
	EEulerRotationOrder                                ___S_0_0_0_0n0_c_R_204;                                     // 0x13B0   (0x0001)  
	unsigned char                                      UnknownData47_6[0x7];                                       // 0x13B1   (0x0007)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_205;                                     // 0x13B8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_206;                                     // 0x13C0   (0x0008)  
	FFilterOptionPerAxis                               ___S_0_0_0_0n0_c_R_207;                                     // 0x13C8   (0x0003)  
	unsigned char                                      UnknownData48_6[0x5];                                       // 0x13CB   (0x0005)  MISSED
	TArray<FConstraintParent>                          ___S_0_0_0_0n0_c_R_208;                                     // 0x13D0   (0x0010)  
	FRigUnit_RotationConstraint_AdvancedSettings       ___S_0_0_0_0n0_c_R_209;                                     // 0x13E0   (0x0002)  
	bool                                               ___S_0_0_0_0n0_c_R_210;                                     // 0x13E2   (0x0001)  
	ERigUnitDebugTransformMode                         ___S_0_0_0_0n0_c_R_211;                                     // 0x13E3   (0x0001)  
	FLinearColor                                       ___S_0_0_0_0n0_c_R_212;                                     // 0x13E4   (0x0010)  
	float                                              ___S_0_0_0_0n0_c_R_213;                                     // 0x13F4   (0x0004)  
	float                                              ___S_0_0_0_0n0_c_R_214;                                     // 0x13F8   (0x0004)  
};

/// Struct /Engine/Transient.PropertyBag_c8e675347a110da1
/// Size: 0x5760 (22368 bytes) (0x000000 - 0x005760) align 16 MaxSize: 0x5760
struct FPropertyBag_c8e675347a110da1
{ 
	FTransform                                         RigVMModel___RigUnit_GetTransform_Transform;                // 0x0000   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_CachedIndex;              // 0x0060   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_CachedIndex;              // 0x0070   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_1_Transform;              // 0x0080   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_1_CachedIndex;            // 0x00E0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_1_CachedIndex;            // 0x00F0   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_2_Transform;              // 0x0100   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_2_CachedIndex;            // 0x0160   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_2_CachedIndex;            // 0x0170   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_1_1_Transform;            // 0x0180   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_1_1_CachedIndex;          // 0x01E0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_1_1_CachedIndex;          // 0x01F0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___ParentConstraint_ChildCache;             // 0x0200   (0x0010)  
	SDK_UNDEFINED(16,1231) /* TArray<TArray<FCachedRigElement>> */ __um(RigVMModel_Rig_2___ParentConstraint_ParentCaches); // 0x0210   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_ChildCache; // 0x0220   (0x0010)  
	SDK_UNDEFINED(16,1232) /* TArray<TArray<FCachedRigElement>> */ __um(RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_ParentCaches); // 0x0230   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_ChildCache; // 0x0240   (0x0010)  
	SDK_UNDEFINED(16,1233) /* TArray<TArray<FCachedRigElement>> */ __um(RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_ParentCaches); // 0x0250   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_1_ChildCache; // 0x0260   (0x0010)  
	SDK_UNDEFINED(16,1234) /* TArray<TArray<FCachedRigElement>> */ __um(RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_1_ParentCaches); // 0x0270   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_ChildCache; // 0x0280   (0x0010)  
	SDK_UNDEFINED(16,1235) /* TArray<TArray<FCachedRigElement>> */ __um(RigVMModel_Rig_2___RotationConstraintLocalSpaceOffset_3_1_ParentCaches); // 0x0290   (0x0010)  
	FTransform                                         RigVMModel_Rig_2___RigUnit_GetTransform_Transform;          // 0x02A0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel_Rig_2___RigUnit_GetTransform_CachedIndex;        // 0x0300   (0x0010)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_5_BlockToRun; // 0x0310   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_1_1_1_1_1_BlockToRun; // 0x0318   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_1_1_1_1_BlockToRun; // 0x0320   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_1_1_1_BlockToRun; // 0x0328   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_1_1_BlockToRun; // 0x0330   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_1_BlockToRun; // 0x0338   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_1_BlockToRun; // 0x0340   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_1_BlockToRun; // 0x0348   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_1_BlockToRun; // 0x0350   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_4_BlockToRun; // 0x0358   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_5_1_BlockToRun; // 0x0360   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_;                                        // 0x0368   (0x0001)  
	bool                                               L;                                                          // 0x0369   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x036A   (0x0002)  MISSED
	FName                                              L0;                                                         // 0x036C   (0x0008)  
	FName                                              MR___0_0_0_0n0_c_R_1;                                       // 0x0374   (0x0008)  
	FName                                              L2;                                                         // 0x037C   (0x0008)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_3;                                       // 0x0384   (0x000C)  
	FTransform                                         MR___0_0_0_0n0_c_R_4;                                       // 0x0390   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_5;                                       // 0x03F0   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x03FC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_6;                                       // 0x0400   (0x0010)  
	FTransform                                         MR___0_0_0_0n0_c_R_7;                                       // 0x0410   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_8;                                       // 0x0470   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_9;                                       // 0x0480   (0x000C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x048C   (0x0004)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_10;                                      // 0x0490   (0x0060)  
	FTransform                                         MR___0_0_0_0n0_c_R_11;                                      // 0x04F0   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_12;                                      // 0x0550   (0x000C)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x055C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_13;                                      // 0x0560   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_14;                                      // 0x0570   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_15;                                      // 0x0588   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_16;                                      // 0x05D0   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_17;                                      // 0x05E8   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_18;                                      // 0x05F0   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_19;                                      // 0x0608   (0x0048)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_20;                                      // 0x0650   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_21;                                      // 0x0660   (0x0010)  
	TArray<bool>                                       MR___0_0_0_0n0_c_R_22;                                      // 0x0670   (0x0010)  
	FQuat                                              MR___0_0_0_0n0_c_R_23;                                      // 0x0680   (0x0020)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_24;                                      // 0x06A0   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_25;                                      // 0x06B0   (0x000C)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x06BC   (0x0004)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_26;                                      // 0x06C0   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_27;                                      // 0x06E0   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_28;                                      // 0x06E8   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_29;                                      // 0x06F0   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_;                                                // 0x06F8   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_30;                                      // 0x0748   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_31;                                      // 0x0750   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_32;                                      // 0x0758   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_33;                                      // 0x0760   (0x0008)  
	float                                              __n0_V_____0___Q_;                                          // 0x0768   (0x0004)  
	bool                                               __n0_V_____0___Q_34;                                        // 0x076C   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x076D   (0x0003)  MISSED
	double                                             __n0_V_____0___Q_35;                                        // 0x0770   (0x0008)  
	bool                                               __n0_V_____0___Q_36;                                        // 0x0778   (0x0001)  
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x0779   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_;                                            // 0x0780   (0x0050)  
	FVector                                            __n0_V_____0___Q_37;                                        // 0x07D0   (0x0018)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0;                                               // 0x07E8   (0x0050)  
	unsigned char                                      UnknownData07_6[0x8];                                       // 0x0838   (0x0008)  MISSED
	FQuat                                              __n0_V_____0___Q_38;                                        // 0x0840   (0x0020)  
	FQuat                                              __n0_V_____0___Q_39;                                        // 0x0860   (0x0020)  
	FQuat                                              __n0_V_____0___Q_40;                                        // 0x0880   (0x0020)  
	FTransform                                         __n0_V_____0___Q_41;                                        // 0x08A0   (0x0060)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_42;                                          // 0x0900   (0x0050)  
	FTransform                                         __n0_V_____0___Q_43;                                        // 0x0950   (0x0060)  
	FName                                              __n0_V_____0___Q_44;                                        // 0x09B0   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_45;                                        // 0x09B8   (0x000C)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x09C4   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_46;                                        // 0x09C8   (0x0010)  
	unsigned char                                      UnknownData09_6[0x8];                                       // 0x09D8   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_47;                                        // 0x09E0   (0x0060)  
	FName                                              __n0_V_____0___Q_48;                                        // 0x0A40   (0x0008)  
	FName                                              __n0_V_____0___Q_49;                                        // 0x0A48   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_50;                                        // 0x0A50   (0x000C)  
	unsigned char                                      UnknownData10_6[0x4];                                       // 0x0A5C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_51;                                        // 0x0A60   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_52;                                        // 0x0A70   (0x0048)  
	unsigned char                                      UnknownData11_6[0x8];                                       // 0x0AB8   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_53;                                        // 0x0AC0   (0x0060)  
	FQuat                                              __n0_V_____0___Q_54;                                        // 0x0B20   (0x0020)  
	FTransform                                         __n0_V_____0___Q_55;                                        // 0x0B40   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_56;                                        // 0x0BA0   (0x000C)  
	unsigned char                                      UnknownData12_6[0x4];                                       // 0x0BAC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_57;                                        // 0x0BB0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_58;                                        // 0x0BC0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_59;                                        // 0x0BE0   (0x0020)  
	FVector                                            __n0_V_____0___Q_60;                                        // 0x0C00   (0x0018)  
	unsigned char                                      UnknownData13_6[0x8];                                       // 0x0C18   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_61;                                        // 0x0C20   (0x0060)  
	SDK_UNDEFINED(16,1236) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x0C80   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_63;                                        // 0x0C90   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_64;                                        // 0x0CD8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_65;                                        // 0x0CE8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_66;                                        // 0x0CF8   (0x0010)  
	unsigned char                                      UnknownData14_6[0x8];                                       // 0x0D08   (0x0008)  MISSED
	FQuat                                              __n0_V_____0___Q_67;                                        // 0x0D10   (0x0020)  
	FTransform                                         __n0_V_____0___Q_68;                                        // 0x0D30   (0x0060)  
	FTransform                                         __n0_V_____0___Q_69;                                        // 0x0D90   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_70;                                        // 0x0DF0   (0x000C)  
	unsigned char                                      UnknownData15_6[0x4];                                       // 0x0DFC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_71;                                        // 0x0E00   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_72;                                        // 0x0E10   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_73;                                        // 0x0E58   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_74;                                        // 0x0EA0   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_75;                                        // 0x0EB0   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_76;                                        // 0x0EC0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_77;                                        // 0x0ED0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_78;                                        // 0x0EF0   (0x0020)  
	double                                             __n0_V_____0___Q_79;                                        // 0x0F10   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_80;                                          // 0x0F18   (0x0050)  
	FVector                                            __n0_V_____0___Q_81;                                        // 0x0F68   (0x0018)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_82;                                          // 0x0F80   (0x0050)  
	FQuat                                              __n0_V_____0___Q_83;                                        // 0x0FD0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_84;                                        // 0x0FF0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_85;                                        // 0x1010   (0x0020)  
	FTransform                                         __n0_V_____0___Q_86;                                        // 0x1030   (0x0060)  
	FTransform                                         __n0_V_____0___Q_87;                                        // 0x1090   (0x0060)  
	FName                                              __n0_V_____0___Q_88;                                        // 0x10F0   (0x0008)  
	FName                                              __n0_V_____0___Q_89;                                        // 0x10F8   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_90;                                        // 0x1100   (0x000C)  
	unsigned char                                      UnknownData16_6[0x4];                                       // 0x110C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_91;                                        // 0x1110   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_92;                                        // 0x1120   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_93;                                        // 0x1168   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_94;                                        // 0x11B0   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_95;                                        // 0x11C0   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_96;                                        // 0x11D0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_97;                                        // 0x11E0   (0x0020)  
	FTransform                                         __n0_V_____0___Q_98;                                        // 0x1200   (0x0060)  
	FTransform                                         __n0_V_____0___Q_99;                                        // 0x1260   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_100;                                       // 0x12C0   (0x000C)  
	unsigned char                                      UnknownData17_6[0x4];                                       // 0x12CC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_101;                                       // 0x12D0   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_102;                                       // 0x12E0   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_103;                                       // 0x1328   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_104;                                       // 0x1370   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_105;                                       // 0x1380   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_106;                                       // 0x1390   (0x0010)  
	FQuat                                              __n0_V_____0___Q_107;                                       // 0x13A0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_108;                                       // 0x13C0   (0x0020)  
	double                                             __n0_V_____0___Q_109;                                       // 0x13E0   (0x0008)  
	bool                                               __n0_V_____0___Q_110;                                       // 0x13E8   (0x0001)  
	unsigned char                                      UnknownData18_6[0x3];                                       // 0x13E9   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_111;                                       // 0x13EC   (0x0004)  
	float                                              __n0_V_____0___Q_112;                                       // 0x13F0   (0x0004)  
	float                                              __n0_V_____0___Q_113;                                       // 0x13F4   (0x0004)  
	bool                                               __n0_V_____0___Q_114;                                       // 0x13F8   (0x0001)  
	unsigned char                                      UnknownData19_6[0x7];                                       // 0x13F9   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_115;                                       // 0x1400   (0x0008)  
	bool                                               __n0_V_____0___Q_116;                                       // 0x1408   (0x0001)  
	bool                                               __n0_V_____0___Q_117;                                       // 0x1409   (0x0001)  
	unsigned char                                      UnknownData20_6[0x2];                                       // 0x140A   (0x0002)  MISSED
	float                                              __n0_V_____0___Q_118;                                       // 0x140C   (0x0004)  
	float                                              __n0_V_____0___Q_119;                                       // 0x1410   (0x0004)  
	float                                              __n0_V_____0___Q_120;                                       // 0x1414   (0x0004)  
	bool                                               __n0_V_____0___Q_121;                                       // 0x1418   (0x0001)  
	unsigned char                                      UnknownData21_6[0x7];                                       // 0x1419   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_122;                                       // 0x1420   (0x0008)  
	bool                                               __n0_V_____0___Q_123;                                       // 0x1428   (0x0001)  
	unsigned char                                      UnknownData22_6[0x7];                                       // 0x1429   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_124;                                         // 0x1430   (0x0050)  
	FVector                                            __n0_V_____0___Q_125;                                       // 0x1480   (0x0018)  
	double                                             __n0_V_____0___Q_126;                                       // 0x1498   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0;                                             // 0x14A0   (0x0050)  
	FVector                                            __n0_V_____0___Q_127;                                       // 0x14F0   (0x0018)  
	double                                             __n0_V_____0___Q_128;                                       // 0x1508   (0x0008)  
	bool                                               __n0_V_____0___Q_129;                                       // 0x1510   (0x0001)  
	unsigned char                                      UnknownData23_6[0x3];                                       // 0x1511   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_130;                                       // 0x1514   (0x0004)  
	float                                              __n0_V_____0___Q_131;                                       // 0x1518   (0x0004)  
	float                                              __n0_V_____0___Q_132;                                       // 0x151C   (0x0004)  
	bool                                               __n0_V_____0___Q_133;                                       // 0x1520   (0x0001)  
	unsigned char                                      UnknownData24_6[0x7];                                       // 0x1521   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_134;                                       // 0x1528   (0x0008)  
	bool                                               __n0_V_____0___Q_135;                                       // 0x1530   (0x0001)  
	bool                                               __n0_V_____0___Q_136;                                       // 0x1531   (0x0001)  
	unsigned char                                      UnknownData25_6[0x2];                                       // 0x1532   (0x0002)  MISSED
	float                                              __n0_V_____0___Q_137;                                       // 0x1534   (0x0004)  
	float                                              __n0_V_____0___Q_138;                                       // 0x1538   (0x0004)  
	unsigned char                                      UnknownData26_6[0x4];                                       // 0x153C   (0x0004)  MISSED
	double                                             MR___0_0_0_0n0_c_R_139;                                     // 0x1540   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_140;                                     // 0x1548   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_141;                                     // 0x1550   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_142;                                     // 0x1558   (0x0008)  
	float                                              __n0_V_____0___Q_143;                                       // 0x1560   (0x0004)  
	bool                                               __n0_V_____0___Q_144;                                       // 0x1564   (0x0001)  
	unsigned char                                      UnknownData27_6[0x3];                                       // 0x1565   (0x0003)  MISSED
	double                                             __n0_V_____0___Q_145;                                       // 0x1568   (0x0008)  
	bool                                               __n0_V_____0___Q_146;                                       // 0x1570   (0x0001)  
	unsigned char                                      UnknownData28_6[0x7];                                       // 0x1571   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_;                                          // 0x1578   (0x0050)  
	FVector                                            __n0_V_____0___Q_147;                                       // 0x15C8   (0x0018)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0148;                                          // 0x15E0   (0x0050)  
	FQuat                                              __n0_V_____0___Q_149;                                       // 0x1630   (0x0020)  
	FQuat                                              __n0_V_____0___Q_150;                                       // 0x1650   (0x0020)  
	FQuat                                              __n0_V_____0___Q_151;                                       // 0x1670   (0x0020)  
	FTransform                                         __n0_V_____0___Q_152;                                       // 0x1690   (0x0060)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_153;                                       // 0x16F0   (0x0050)  
	FTransform                                         __n0_V_____0___Q_154;                                       // 0x1740   (0x0060)  
	FName                                              __n0_V_____0___Q_155;                                       // 0x17A0   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_156;                                       // 0x17A8   (0x000C)  
	unsigned char                                      UnknownData29_6[0x4];                                       // 0x17B4   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_157;                                       // 0x17B8   (0x0010)  
	unsigned char                                      UnknownData30_6[0x8];                                       // 0x17C8   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_158;                                       // 0x17D0   (0x0060)  
	FName                                              __n0_V_____0___Q_159;                                       // 0x1830   (0x0008)  
	FName                                              __n0_V_____0___Q_160;                                       // 0x1838   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_161;                                       // 0x1840   (0x000C)  
	unsigned char                                      UnknownData31_6[0x4];                                       // 0x184C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_162;                                       // 0x1850   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_163;                                       // 0x1860   (0x0048)  
	unsigned char                                      UnknownData32_6[0x8];                                       // 0x18A8   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_164;                                       // 0x18B0   (0x0060)  
	FQuat                                              __n0_V_____0___Q_165;                                       // 0x1910   (0x0020)  
	FTransform                                         __n0_V_____0___Q_166;                                       // 0x1930   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_167;                                       // 0x1990   (0x000C)  
	unsigned char                                      UnknownData33_6[0x4];                                       // 0x199C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_168;                                       // 0x19A0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_169;                                       // 0x19B0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_170;                                       // 0x19D0   (0x0020)  
	FVector                                            __n0_V_____0___Q_171;                                       // 0x19F0   (0x0018)  
	unsigned char                                      UnknownData34_6[0x8];                                       // 0x1A08   (0x0008)  MISSED
	FTransform                                         __n0_V_____0___Q_172;                                       // 0x1A10   (0x0060)  
	SDK_UNDEFINED(16,1237) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x1A70   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_174;                                       // 0x1A80   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_175;                                       // 0x1AC8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_176;                                       // 0x1AD8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_177;                                       // 0x1AE8   (0x0010)  
	unsigned char                                      UnknownData35_6[0x8];                                       // 0x1AF8   (0x0008)  MISSED
	FQuat                                              __n0_V_____0___Q_178;                                       // 0x1B00   (0x0020)  
	FTransform                                         __n0_V_____0___Q_179;                                       // 0x1B20   (0x0060)  
	FTransform                                         __n0_V_____0___Q_180;                                       // 0x1B80   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_181;                                       // 0x1BE0   (0x000C)  
	unsigned char                                      UnknownData36_6[0x4];                                       // 0x1BEC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_182;                                       // 0x1BF0   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_183;                                       // 0x1C00   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_184;                                       // 0x1C48   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_185;                                       // 0x1C90   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_186;                                       // 0x1CA0   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_187;                                       // 0x1CB0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_188;                                       // 0x1CC0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_189;                                       // 0x1CE0   (0x0020)  
	double                                             __n0_V_____0___Q_190;                                       // 0x1D00   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_191;                                       // 0x1D08   (0x0050)  
	FVector                                            __n0_V_____0___Q_192;                                       // 0x1D58   (0x0018)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_193;                                       // 0x1D70   (0x0050)  
	FQuat                                              __n0_V_____0___Q_194;                                       // 0x1DC0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_195;                                       // 0x1DE0   (0x0020)  
	FQuat                                              __n0_V_____0___Q_196;                                       // 0x1E00   (0x0020)  
	FTransform                                         __n0_V_____0___Q_197;                                       // 0x1E20   (0x0060)  
	FTransform                                         __n0_V_____0___Q_198;                                       // 0x1E80   (0x0060)  
	FName                                              __n0_V_____0___Q_199;                                       // 0x1EE0   (0x0008)  
	FName                                              __n0_V_____0___Q_200;                                       // 0x1EE8   (0x0008)  
	FRigElementKey                                     __n0_V_____0___Q_201;                                       // 0x1EF0   (0x000C)  
	unsigned char                                      UnknownData37_6[0x4];                                       // 0x1EFC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_202;                                       // 0x1F00   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_203;                                       // 0x1F10   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_204;                                       // 0x1F58   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_205;                                       // 0x1FA0   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_206;                                       // 0x1FB0   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_207;                                       // 0x1FC0   (0x0010)  
	FQuat                                              __n0_V_____0___Q_208;                                       // 0x1FD0   (0x0020)  
	FTransform                                         __n0_V_____0___Q_209;                                       // 0x1FF0   (0x0060)  
	FTransform                                         __n0_V_____0___Q_210;                                       // 0x2050   (0x0060)  
	FRigElementKey                                     __n0_V_____0___Q_211;                                       // 0x20B0   (0x000C)  
	unsigned char                                      UnknownData38_6[0x4];                                       // 0x20BC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          __n0_V_____0___Q_212;                                       // 0x20C0   (0x0010)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_213;                                       // 0x20D0   (0x0048)  
	FRigUnit_AimItem_Target                            __n0_V_____0___Q_214;                                       // 0x2118   (0x0048)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_215;                                       // 0x2160   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_216;                                       // 0x2170   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_217;                                       // 0x2180   (0x0010)  
	FQuat                                              __n0_V_____0___Q_218;                                       // 0x2190   (0x0020)  
	FQuat                                              __n0_V_____0___Q_219;                                       // 0x21B0   (0x0020)  
	double                                             __n0_V_____0___Q_220;                                       // 0x21D0   (0x0008)  
	bool                                               __n0_V_____0___Q_221;                                       // 0x21D8   (0x0001)  
	unsigned char                                      UnknownData39_6[0x3];                                       // 0x21D9   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_222;                                       // 0x21DC   (0x0004)  
	float                                              __n0_V_____0___Q_223;                                       // 0x21E0   (0x0004)  
	float                                              __n0_V_____0___Q_224;                                       // 0x21E4   (0x0004)  
	bool                                               __n0_V_____0___Q_225;                                       // 0x21E8   (0x0001)  
	unsigned char                                      UnknownData40_6[0x7];                                       // 0x21E9   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_226;                                       // 0x21F0   (0x0008)  
	bool                                               __n0_V_____0___Q_227;                                       // 0x21F8   (0x0001)  
	bool                                               __n0_V_____0___Q_228;                                       // 0x21F9   (0x0001)  
	unsigned char                                      UnknownData41_6[0x2];                                       // 0x21FA   (0x0002)  MISSED
	float                                              __n0_V_____0___Q_229;                                       // 0x21FC   (0x0004)  
	float                                              __n0_V_____0___Q_230;                                       // 0x2200   (0x0004)  
	float                                              __n0_V_____0___Q_231;                                       // 0x2204   (0x0004)  
	bool                                               __n0_V_____0___Q_232;                                       // 0x2208   (0x0001)  
	unsigned char                                      UnknownData42_6[0x7];                                       // 0x2209   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_233;                                       // 0x2210   (0x0008)  
	bool                                               __n0_V_____0___Q_234;                                       // 0x2218   (0x0001)  
	unsigned char                                      UnknownData43_6[0x7];                                       // 0x2219   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_235;                                       // 0x2220   (0x0050)  
	FVector                                            __n0_V_____0___Q_236;                                       // 0x2270   (0x0018)  
	double                                             __n0_V_____0___Q_237;                                       // 0x2288   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c;                                           // 0x2290   (0x0050)  
	FVector                                            __n0_V_____0___Q_238;                                       // 0x22E0   (0x0018)  
	double                                             __n0_V_____0___Q_239;                                       // 0x22F8   (0x0008)  
	bool                                               __n0_V_____0___Q_240;                                       // 0x2300   (0x0001)  
	unsigned char                                      UnknownData44_6[0x3];                                       // 0x2301   (0x0003)  MISSED
	float                                              __n0_V_____0___Q_241;                                       // 0x2304   (0x0004)  
	float                                              __n0_V_____0___Q_242;                                       // 0x2308   (0x0004)  
	float                                              __n0_V_____0___Q_243;                                       // 0x230C   (0x0004)  
	bool                                               __n0_V_____0___Q_244;                                       // 0x2310   (0x0001)  
	unsigned char                                      UnknownData45_6[0x7];                                       // 0x2311   (0x0007)  MISSED
	double                                             __n0_V_____0___Q_245;                                       // 0x2318   (0x0008)  
	bool                                               __n0_V_____0___Q_246;                                       // 0x2320   (0x0001)  
	bool                                               __n0_V_____0___Q_247;                                       // 0x2321   (0x0001)  
	unsigned char                                      UnknownData46_6[0x2];                                       // 0x2322   (0x0002)  MISSED
	float                                              __n0_V_____0___Q_248;                                       // 0x2324   (0x0004)  
	float                                              __n0_V_____0___Q_249;                                       // 0x2328   (0x0004)  
	unsigned char                                      UnknownData47_6[0x4];                                       // 0x232C   (0x0004)  MISSED
	FVector                                            MR___0_0_0_0n0_c_R_250;                                     // 0x2330   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_251;                                     // 0x2348   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_252;                                     // 0x2350   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_253;                                     // 0x2358   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_254;                                     // 0x2360   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_255;                                     // 0x2368   (0x0001)  
	unsigned char                                      UnknownData48_6[0x3];                                       // 0x2369   (0x0003)  MISSED
	float                                              MR___0_0_0_0n0_c_R_256;                                     // 0x236C   (0x0004)  
	double                                             MR___0_0_0_0n0_c_R_257;                                     // 0x2370   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_258;                                     // 0x2378   (0x0001)  
	unsigned char                                      UnknownData49_6[0x7];                                       // 0x2379   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_Rt;                                        // 0x2380   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_259;                                     // 0x23D0   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_260;                                     // 0x23D8   (0x0001)  
	unsigned char                                      UnknownData50_6[0x7];                                       // 0x23D9   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_261;                                     // 0x23E0   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_262;                                     // 0x23E8   (0x0004)  
	unsigned char                                      UnknownData51_6[0x4];                                       // 0x23EC   (0x0004)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_263;                                             // 0x23F0   (0x0050)  
	FRuntimeFloatCurve                                 MR___0_0_0_0n0_c_R_264;                                     // 0x2440   (0x0088)  
	double                                             MR___0_0_0_0n0_c_R_265;                                     // 0x24C8   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_266;                                     // 0x24D0   (0x0004)  
	unsigned char                                      UnknownData52_6[0x4];                                       // 0x24D4   (0x0004)  MISSED
	double                                             MR___0_0_0_0n0_c_R_267;                                     // 0x24D8   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_268;                                     // 0x24E0   (0x0001)  
	unsigned char                                      UnknownData53_6[0x7];                                       // 0x24E1   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_Rt269;                                     // 0x24E8   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_270;                                     // 0x2538   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_271;                                     // 0x2540   (0x0001)  
	unsigned char                                      UnknownData54_6[0x7];                                       // 0x2541   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_272;                                     // 0x2548   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_273;                                     // 0x2550   (0x0004)  
	unsigned char                                      UnknownData55_6[0x4];                                       // 0x2554   (0x0004)  MISSED
	double                                             MR___0_0_0_0n0_c_R_274;                                     // 0x2558   (0x0008)  
	double                                             p_n0_V__k0_0_0_____b6R_;                                    // 0x2560   (0x0008)  
	double                                             p_n0_V__k0_0_0_____b6R_275;                                 // 0x2568   (0x0008)  
	double                                             p_n0_V__k0_0_0_____b6R_276;                                 // 0x2570   (0x0008)  
	float                                              p_n0_V__k0_0_0_____b6R_277;                                 // 0x2578   (0x0004)  
	unsigned char                                      UnknownData56_6[0x4];                                       // 0x257C   (0x0004)  MISSED
	FQuat                                              p_n0_V__k0_0_0_____b6R_278;                                 // 0x2580   (0x0020)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_279;                                 // 0x25A0   (0x0020)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_280;                                 // 0x25C0   (0x0020)  
	FTransform                                         p_n0_V__k0_0_0_____b6R_281;                                 // 0x25E0   (0x0060)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_282;                                 // 0x2640   (0x0010)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_283;                                 // 0x2650   (0x0020)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_284;                                 // 0x2670   (0x0020)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_285;                                 // 0x2690   (0x0020)  
	FTransform                                         p_n0_V__k0_0_0_____b6R_286;                                 // 0x26B0   (0x0060)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_287;                                 // 0x2710   (0x0010)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_288;                                 // 0x2720   (0x0020)  
	FQuat                                              p_n0_V__k0_0_0_____b6R_289;                                 // 0x2740   (0x0020)  
	FVector                                            p_n0_V__k0_0_0_____b6R_290;                                 // 0x2760   (0x0018)  
	double                                             p_n0_V__k0_0_0_____b6R_291;                                 // 0x2778   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_292;                                     // 0x2780   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_293;                                     // 0x2788   (0x0018)  
	FTransform                                         MR___0_0_0_0n0_c_R_294;                                     // 0x27A0   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_295;                                     // 0x2800   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_296;                                     // 0x2810   (0x000C)  
	unsigned char                                      UnknownData57_6[0x4];                                       // 0x281C   (0x0004)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_297;                                     // 0x2820   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_298;                                     // 0x2840   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_299;                                     // 0x2848   (0x0018)  
	FQuat                                              MR___0_0_0_0n0_c_R_300;                                     // 0x2860   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_301;                                     // 0x2880   (0x0020)  
	FTransform                                         MR___0_0_0_0n0_c_R_302;                                     // 0x28A0   (0x0060)  
	FVector                                            MR___0_0_0_0n0_c_R_303;                                     // 0x2900   (0x0018)  
	unsigned char                                      UnknownData58_6[0x8];                                       // 0x2918   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_304;                                     // 0x2920   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_305;                                     // 0x2980   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_306;                                     // 0x2990   (0x0018)  
	unsigned char                                      UnknownData59_6[0x8];                                       // 0x29A8   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_307;                                     // 0x29B0   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_308;                                     // 0x2A10   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_309;                                     // 0x2A20   (0x0018)  
	unsigned char                                      UnknownData60_6[0x8];                                       // 0x2A38   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_310;                                     // 0x2A40   (0x0060)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_311;                                     // 0x2AA0   (0x0048)  
	unsigned char                                      UnknownData61_6[0x8];                                       // 0x2AE8   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_312;                                     // 0x2AF0   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_313;                                     // 0x2B50   (0x0010)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_314;                                     // 0x2B60   (0x0048)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_315;                                     // 0x2BA8   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_316;                                     // 0x2BB8   (0x0010)  
	TArray<bool>                                       MR___0_0_0_0n0_c_R_317;                                     // 0x2BC8   (0x0010)  
	unsigned char                                      UnknownData62_6[0x8];                                       // 0x2BD8   (0x0008)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_318;                                     // 0x2BE0   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_319;                                     // 0x2C00   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_320;                                     // 0x2C20   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_321;                                     // 0x2C40   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_322;                                     // 0x2C60   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_323;                                     // 0x2C68   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_324;                                     // 0x2C70   (0x0018)  
	unsigned char                                      UnknownData63_6[0x8];                                       // 0x2C88   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_325;                                     // 0x2C90   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_326;                                     // 0x2CF0   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_327;                                     // 0x2D00   (0x000C)  
	unsigned char                                      UnknownData64_6[0x4];                                       // 0x2D0C   (0x0004)  MISSED
	TArray<FConstraintParent>                          MR___0_0_0_0n0_c_R_328;                                     // 0x2D10   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_329;                                     // 0x2D20   (0x0010)  
	SDK_UNDEFINED(16,1238) /* TArray<TArray<FCachedRigElement>> */ __um(MR___0_0_0_0n0_c_R_);                      // 0x2D30   (0x0010)  
	FTransform                                         MR___0_0_0_0n0_c_R_331;                                     // 0x2D40   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_332;                                     // 0x2DA0   (0x000C)  
	unsigned char                                      UnknownData65_6[0x4];                                       // 0x2DAC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_333;                                     // 0x2DB0   (0x0010)  
	bool                                               MR___0_0_0_0n0_c_R_334;                                     // 0x2DC0   (0x0001)  
	unsigned char                                      UnknownData66_6[0x3];                                       // 0x2DC1   (0x0003)  MISSED
	FName                                              MR___0_0_0_0n0_c_R_335;                                     // 0x2DC4   (0x0008)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_336;                                     // 0x2DCC   (0x000C)  
	unsigned char                                      UnknownData67_6[0x8];                                       // 0x2DD8   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_337;                                     // 0x2DE0   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_338;                                     // 0x2E40   (0x000C)  
	unsigned char                                      UnknownData68_6[0x4];                                       // 0x2E4C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_339;                                     // 0x2E50   (0x0010)  
	FTransform                                         MR___0_0_0_0n0_c_R_340;                                     // 0x2E60   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_341;                                     // 0x2EC0   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_342;                                     // 0x2ED0   (0x000C)  
	unsigned char                                      UnknownData69_6[0x4];                                       // 0x2EDC   (0x0004)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_343;                                     // 0x2EE0   (0x0060)  
	FTransform                                         MR___0_0_0_0n0_c_R_344;                                     // 0x2F40   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_345;                                     // 0x2FA0   (0x000C)  
	unsigned char                                      UnknownData70_6[0x4];                                       // 0x2FAC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_346;                                     // 0x2FB0   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_347;                                     // 0x2FC0   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_348;                                     // 0x2FD8   (0x0048)  
	FVector                                            MR___0_0_0_0n0_c_R_349;                                     // 0x3020   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_350;                                     // 0x3038   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_351;                                     // 0x3040   (0x0018)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_352;                                     // 0x3058   (0x0048)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_353;                                     // 0x30A0   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_354;                                     // 0x30B0   (0x0010)  
	TArray<bool>                                       MR___0_0_0_0n0_c_R_355;                                     // 0x30C0   (0x0010)  
	FQuat                                              MR___0_0_0_0n0_c_R_356;                                     // 0x30D0   (0x0020)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_357;                                     // 0x30F0   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_358;                                     // 0x3100   (0x000C)  
	unsigned char                                      UnknownData71_6[0x4];                                       // 0x310C   (0x0004)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_359;                                     // 0x3110   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_360;                                     // 0x3130   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_361;                                     // 0x3138   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_362;                                     // 0x3140   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n;                                              // 0x3148   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_363;                                     // 0x3198   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_364;                                     // 0x31A0   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_365;                                     // 0x31A8   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_366;                                     // 0x31B0   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_;                                                  // 0x31B8   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_367;                                               // 0x3208   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_368;                                               // 0x3258   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_369;                                       // 0x32A8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_370;                                       // 0x32B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_371;                                       // 0x32C8   (0x0010)  
	SDK_UNDEFINED(16,1239) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x32D8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_373;                                       // 0x32E8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_374;                                       // 0x32F8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_375;                                       // 0x3308   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_376;                                       // 0x3318   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_377;                                       // 0x3328   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_378;                                       // 0x3338   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_379;                                       // 0x3348   (0x0010)  
	FRigVMInstructionSetExecuteState                   MR___0_0_380;                                               // 0x3358   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_381;                                               // 0x33A8   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_382;                                       // 0x33F8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_383;                                       // 0x3408   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_384;                                       // 0x3418   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_385;                                       // 0x3428   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_386;                                       // 0x3438   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_387;                                       // 0x3448   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_388;                                       // 0x3458   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_389;                                       // 0x3468   (0x0010)  
	FRigVMInstructionSetExecuteState                   MR___0_0_390;                                               // 0x3478   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_391;                                               // 0x34C8   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_392;                                     // 0x3518   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_393;                                     // 0x3520   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_394;                                     // 0x3528   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_395;                                     // 0x3530   (0x0008)  
	FRigVMInstructionSetExecuteState                   MR___0_0_396;                                               // 0x3538   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_397;                                               // 0x3588   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_398;                                               // 0x35D8   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_399;                                       // 0x3628   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_400;                                       // 0x3638   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_401;                                       // 0x3648   (0x0010)  
	SDK_UNDEFINED(16,1240) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x3658   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_403;                                       // 0x3668   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_404;                                       // 0x3678   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_405;                                       // 0x3688   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_406;                                       // 0x3698   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_407;                                       // 0x36A8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_408;                                       // 0x36B8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_409;                                       // 0x36C8   (0x0010)  
	FRigVMInstructionSetExecuteState                   MR___0_0_410;                                               // 0x36D8   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_411;                                               // 0x3728   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_412;                                       // 0x3778   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_413;                                       // 0x3788   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_414;                                       // 0x3798   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_415;                                       // 0x37A8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_416;                                       // 0x37B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_417;                                       // 0x37C8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_418;                                       // 0x37D8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_419;                                       // 0x37E8   (0x0010)  
	FRigVMInstructionSetExecuteState                   MR___0_0_420;                                               // 0x37F8   (0x0050)  
	FRigVMInstructionSetExecuteState                   MR___0_0_421;                                               // 0x3848   (0x0050)  
	FVector                                            MR___0_0_0_0n0_c_R_422;                                     // 0x3898   (0x0018)  
	double                                             MR___0_0_0_0n0_c_R_423;                                     // 0x38B0   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_424;                                     // 0x38B8   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_425;                                     // 0x38C0   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_426;                                     // 0x38C8   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_427;                                     // 0x38D0   (0x0001)  
	unsigned char                                      UnknownData72_6[0x3];                                       // 0x38D1   (0x0003)  MISSED
	float                                              MR___0_0_0_0n0_c_R_428;                                     // 0x38D4   (0x0004)  
	double                                             MR___0_0_0_0n0_c_R_429;                                     // 0x38D8   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_430;                                     // 0x38E0   (0x0001)  
	unsigned char                                      UnknownData73_6[0x7];                                       // 0x38E1   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_R_431;                                     // 0x38E8   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_432;                                     // 0x3938   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_433;                                     // 0x3940   (0x0001)  
	unsigned char                                      UnknownData74_6[0x7];                                       // 0x3941   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_434;                                     // 0x3948   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_435;                                     // 0x3950   (0x0004)  
	unsigned char                                      UnknownData75_6[0x4];                                       // 0x3954   (0x0004)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n436;                                           // 0x3958   (0x0050)  
	FRuntimeFloatCurve                                 MR___0_0_0_0n0_c_R_437;                                     // 0x39A8   (0x0088)  
	double                                             MR___0_0_0_0n0_c_R_438;                                     // 0x3A30   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_439;                                     // 0x3A38   (0x0004)  
	unsigned char                                      UnknownData76_6[0x4];                                       // 0x3A3C   (0x0004)  MISSED
	double                                             MR___0_0_0_0n0_c_R_440;                                     // 0x3A40   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_441;                                     // 0x3A48   (0x0001)  
	unsigned char                                      UnknownData77_6[0x7];                                       // 0x3A49   (0x0007)  MISSED
	FRigVMInstructionSetExecuteState                   MR___0_0_0_0n0_c_R_442;                                     // 0x3A50   (0x0050)  
	double                                             MR___0_0_0_0n0_c_R_443;                                     // 0x3AA0   (0x0008)  
	bool                                               MR___0_0_0_0n0_c_R_444;                                     // 0x3AA8   (0x0001)  
	unsigned char                                      UnknownData78_6[0x7];                                       // 0x3AA9   (0x0007)  MISSED
	double                                             MR___0_0_0_0n0_c_R_445;                                     // 0x3AB0   (0x0008)  
	float                                              MR___0_0_0_0n0_c_R_446;                                     // 0x3AB8   (0x0004)  
	unsigned char                                      UnknownData79_6[0x4];                                       // 0x3ABC   (0x0004)  MISSED
	double                                             MR___0_0_0_0n0_c_R_447;                                     // 0x3AC0   (0x0008)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_448;                                 // 0x3AC8   (0x0010)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_449;                                 // 0x3AD8   (0x0010)  
	double                                             MR___0_0_0_0n0_c_R_450;                                     // 0x3AE8   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_451;                                     // 0x3AF0   (0x0018)  
	unsigned char                                      UnknownData80_6[0x8];                                       // 0x3B08   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_452;                                     // 0x3B10   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_453;                                     // 0x3B70   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_454;                                     // 0x3B80   (0x000C)  
	unsigned char                                      UnknownData81_6[0x4];                                       // 0x3B8C   (0x0004)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_455;                                     // 0x3B90   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_456;                                     // 0x3BB0   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_457;                                     // 0x3BB8   (0x0018)  
	FQuat                                              MR___0_0_0_0n0_c_R_458;                                     // 0x3BD0   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_459;                                     // 0x3BF0   (0x0020)  
	FTransform                                         MR___0_0_0_0n0_c_R_460;                                     // 0x3C10   (0x0060)  
	FVector                                            MR___0_0_0_0n0_c_R_461;                                     // 0x3C70   (0x0018)  
	unsigned char                                      UnknownData82_6[0x8];                                       // 0x3C88   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_462;                                     // 0x3C90   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_463;                                     // 0x3CF0   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_464;                                     // 0x3D00   (0x0018)  
	unsigned char                                      UnknownData83_6[0x8];                                       // 0x3D18   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_465;                                     // 0x3D20   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_466;                                     // 0x3D80   (0x0010)  
	FVector                                            MR___0_0_0_0n0_c_R_467;                                     // 0x3D90   (0x0018)  
	unsigned char                                      UnknownData84_6[0x8];                                       // 0x3DA8   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_468;                                     // 0x3DB0   (0x0060)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_469;                                     // 0x3E10   (0x0048)  
	unsigned char                                      UnknownData85_6[0x8];                                       // 0x3E58   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_470;                                     // 0x3E60   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_471;                                     // 0x3EC0   (0x0010)  
	FRigUnit_AimItem_Target                            MR___0_0_0_0n0_c_R_472;                                     // 0x3ED0   (0x0048)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_473;                                     // 0x3F18   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_474;                                     // 0x3F28   (0x0010)  
	TArray<bool>                                       MR___0_0_0_0n0_c_R_475;                                     // 0x3F38   (0x0010)  
	unsigned char                                      UnknownData86_6[0x8];                                       // 0x3F48   (0x0008)  MISSED
	FQuat                                              MR___0_0_0_0n0_c_R_476;                                     // 0x3F50   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_477;                                     // 0x3F70   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_478;                                     // 0x3F90   (0x0020)  
	FQuat                                              MR___0_0_0_0n0_c_R_479;                                     // 0x3FB0   (0x0020)  
	double                                             MR___0_0_0_0n0_c_R_480;                                     // 0x3FD0   (0x0008)  
	double                                             MR___0_0_0_0n0_c_R_481;                                     // 0x3FD8   (0x0008)  
	FVector                                            MR___0_0_0_0n0_c_R_482;                                     // 0x3FE0   (0x0018)  
	unsigned char                                      UnknownData87_6[0x8];                                       // 0x3FF8   (0x0008)  MISSED
	FTransform                                         MR___0_0_0_0n0_c_R_483;                                     // 0x4000   (0x0060)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_484;                                     // 0x4060   (0x0010)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_485;                                     // 0x4070   (0x000C)  
	unsigned char                                      UnknownData88_6[0x4];                                       // 0x407C   (0x0004)  MISSED
	TArray<FConstraintParent>                          MR___0_0_0_0n0_c_R_486;                                     // 0x4080   (0x0010)  
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_487;                                     // 0x4090   (0x0010)  
	SDK_UNDEFINED(16,1241) /* TArray<TArray<FCachedRigElement>> */ __um(MR___0_0_0_0n0_c_R_);                      // 0x40A0   (0x0010)  
	FTransform                                         MR___0_0_0_0n0_c_R_489;                                     // 0x40B0   (0x0060)  
	FRigElementKey                                     MR___0_0_0_0n0_c_R_490;                                     // 0x4110   (0x000C)  
	unsigned char                                      UnknownData89_6[0x4];                                       // 0x411C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          MR___0_0_0_0n0_c_R_491;                                     // 0x4120   (0x0010)  
	bool                                               ___S_0_0_0_0n0_c_R_;                                        // 0x4130   (0x0001)  
	bool                                               L492;                                                       // 0x4131   (0x0001)  
	unsigned char                                      UnknownData90_6[0x2];                                       // 0x4132   (0x0002)  MISSED
	FName                                              L493;                                                       // 0x4134   (0x0008)  
	FName                                              ___S_0_0_0_0n0_c_R_494;                                     // 0x413C   (0x0008)  
	FName                                              L495;                                                       // 0x4144   (0x0008)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_496;                                     // 0x414C   (0x000C)  
	unsigned char                                      UnknownData91_6[0x8];                                       // 0x4158   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_497;                                     // 0x4160   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_498;                                     // 0x41C0   (0x000C)  
	unsigned char                                      UnknownData92_6[0x4];                                       // 0x41CC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_499;                                     // 0x41D0   (0x0010)  
	FTransform                                         ___S_0_0_0_0n0_c_R_500;                                     // 0x41E0   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_501;                                     // 0x4240   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_502;                                     // 0x4250   (0x000C)  
	unsigned char                                      UnknownData93_6[0x4];                                       // 0x425C   (0x0004)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_503;                                     // 0x4260   (0x0060)  
	FTransform                                         ___S_0_0_0_0n0_c_R_504;                                     // 0x42C0   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_505;                                     // 0x4320   (0x000C)  
	unsigned char                                      UnknownData94_6[0x4];                                       // 0x432C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_506;                                     // 0x4330   (0x0010)  
	FVector                                            ___S_0_0_0_0n0_c_R_507;                                     // 0x4340   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_508;                                     // 0x4358   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_509;                                     // 0x43A0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_510;                                     // 0x43B8   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_511;                                     // 0x43C0   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_512;                                     // 0x43D8   (0x0048)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_513;                                     // 0x4420   (0x0010)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_514;                                     // 0x4430   (0x0010)  
	TArray<bool>                                       ___S_0_0_0_0n0_c_R_515;                                     // 0x4440   (0x0010)  
	FQuat                                              ___S_0_0_0_0n0_c_R_516;                                     // 0x4450   (0x0020)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_517;                                     // 0x4470   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_518;                                     // 0x4480   (0x000C)  
	unsigned char                                      UnknownData95_6[0x4];                                       // 0x448C   (0x0004)  MISSED
	FQuat                                              ___S_0_0_0_0n0_c_R_519;                                     // 0x4490   (0x0020)  
	double                                             ___S_0_0_0_0n0_c_R_520;                                     // 0x44B0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_521;                                     // 0x44B8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_522;                                     // 0x44C0   (0x0008)  
	bool                                               ___S_0_0_0_0n0_c_R_523;                                     // 0x44C8   (0x0001)  
	unsigned char                                      UnknownData96_6[0x3];                                       // 0x44C9   (0x0003)  MISSED
	float                                              ___S_0_0_0_0n0_c_R_524;                                     // 0x44CC   (0x0004)  
	double                                             ___S_0_0_0_0n0_c_R_525;                                     // 0x44D0   (0x0008)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_c_Rt;                                        // 0x44D8   (0x0050)  
	double                                             ___S_0_0_0_0n0_c_R_526;                                     // 0x4528   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_527;                                     // 0x4530   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_528;                                     // 0x4538   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_529;                                     // 0x4540   (0x0008)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_;                                            // 0x4548   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0;                                               // 0x4598   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_530;                                         // 0x45E8   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_531;                                       // 0x4638   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_532;                                       // 0x4648   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_533;                                       // 0x4658   (0x0010)  
	SDK_UNDEFINED(16,1242) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x4668   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_535;                                       // 0x4678   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_536;                                       // 0x4688   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_537;                                       // 0x4698   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_538;                                       // 0x46A8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_539;                                       // 0x46B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_540;                                       // 0x46C8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_541;                                       // 0x46D8   (0x0010)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_542;                                         // 0x46E8   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_543;                                         // 0x4738   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_544;                                       // 0x4788   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_545;                                       // 0x4798   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_546;                                       // 0x47A8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_547;                                       // 0x47B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_548;                                       // 0x47C8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_549;                                       // 0x47D8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_550;                                       // 0x47E8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_551;                                       // 0x47F8   (0x0010)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_552;                                         // 0x4808   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0;                                             // 0x4858   (0x0050)  
	float                                              ___S_0_0_0_0n0_c_R_553;                                     // 0x48A8   (0x0004)  
	unsigned char                                      UnknownData97_6[0x4];                                       // 0x48AC   (0x0004)  MISSED
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_;                                                // 0x48B0   (0x0050)  
	FRuntimeFloatCurve                                 ___S_0_0_0_0n0_c_R_554;                                     // 0x4900   (0x0088)  
	double                                             ___S_0_0_0_0n0_c_R_555;                                     // 0x4988   (0x0008)  
	float                                              ___S_0_0_0_0n0_c_R_556;                                     // 0x4990   (0x0004)  
	unsigned char                                      UnknownData98_6[0x4];                                       // 0x4994   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_557;                                     // 0x4998   (0x0008)  
	float                                              ___S_0_0_0_0n0_c_R_558;                                     // 0x49A0   (0x0004)  
	unsigned char                                      UnknownData99_6[0x4];                                       // 0x49A4   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_559;                                     // 0x49A8   (0x0008)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_560;                                 // 0x49B0   (0x0010)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_561;                                 // 0x49C0   (0x0010)  
	FVector                                            ___S_0_0_0_0n0_c_R_562;                                     // 0x49D0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_563;                                     // 0x49E8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_564;                                     // 0x49F0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_565;                                     // 0x49F8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_566;                                     // 0x4A00   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_567;                                     // 0x4A08   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_568;                                     // 0x4A10   (0x0018)  
	unsigned char                                      UnknownData100_6[0x8];                                      // 0x4A28   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_569;                                     // 0x4A30   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_570;                                     // 0x4A90   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_571;                                     // 0x4AA0   (0x000C)  
	unsigned char                                      UnknownData101_6[0x4];                                      // 0x4AAC   (0x0004)  MISSED
	FQuat                                              ___S_0_0_0_0n0_c_R_572;                                     // 0x4AB0   (0x0020)  
	double                                             ___S_0_0_0_0n0_c_R_573;                                     // 0x4AD0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_574;                                     // 0x4AD8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_575;                                     // 0x4AE0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_576;                                     // 0x4AE8   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_577;                                     // 0x4AF0   (0x0018)  
	unsigned char                                      UnknownData102_6[0x8];                                      // 0x4B08   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_578;                                     // 0x4B10   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_579;                                     // 0x4B70   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_580;                                     // 0x4B80   (0x000C)  
	unsigned char                                      UnknownData103_6[0x4];                                      // 0x4B8C   (0x0004)  MISSED
	TArray<FConstraintParent>                          ___S_0_0_0_0n0_c_R_581;                                     // 0x4B90   (0x0010)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_582;                                     // 0x4BA0   (0x0010)  
	SDK_UNDEFINED(16,1243) /* TArray<TArray<FCachedRigElement>> */ __um(___S_0_0_0_0n0_c_R_);                      // 0x4BB0   (0x0010)  
	FTransform                                         ___S_0_0_0_0n0_c_R_584;                                     // 0x4BC0   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_585;                                     // 0x4C20   (0x000C)  
	unsigned char                                      UnknownData104_6[0x4];                                      // 0x4C2C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_586;                                     // 0x4C30   (0x0010)  
	bool                                               ___S_0_0_0_0n0_c_R_587;                                     // 0x4C40   (0x0001)  
	unsigned char                                      UnknownData105_6[0x3];                                      // 0x4C41   (0x0003)  MISSED
	FName                                              ___S_0_0_0_0n0_c_R_588;                                     // 0x4C44   (0x0008)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_589;                                     // 0x4C4C   (0x000C)  
	unsigned char                                      UnknownData106_6[0x8];                                      // 0x4C58   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_590;                                     // 0x4C60   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_591;                                     // 0x4CC0   (0x000C)  
	unsigned char                                      UnknownData107_6[0x4];                                      // 0x4CCC   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_592;                                     // 0x4CD0   (0x0010)  
	FTransform                                         ___S_0_0_0_0n0_c_R_593;                                     // 0x4CE0   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_594;                                     // 0x4D40   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_595;                                     // 0x4D50   (0x000C)  
	unsigned char                                      UnknownData108_6[0x4];                                      // 0x4D5C   (0x0004)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_596;                                     // 0x4D60   (0x0060)  
	FTransform                                         ___S_0_0_0_0n0_c_R_597;                                     // 0x4DC0   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_598;                                     // 0x4E20   (0x000C)  
	unsigned char                                      UnknownData109_6[0x4];                                      // 0x4E2C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_599;                                     // 0x4E30   (0x0010)  
	FVector                                            ___S_0_0_0_0n0_c_R_600;                                     // 0x4E40   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_601;                                     // 0x4E58   (0x0048)  
	FVector                                            ___S_0_0_0_0n0_c_R_602;                                     // 0x4EA0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_603;                                     // 0x4EB8   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_604;                                     // 0x4EC0   (0x0018)  
	FRigUnit_AimItem_Target                            ___S_0_0_0_0n0_c_R_605;                                     // 0x4ED8   (0x0048)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_606;                                     // 0x4F20   (0x0010)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_607;                                     // 0x4F30   (0x0010)  
	TArray<bool>                                       ___S_0_0_0_0n0_c_R_608;                                     // 0x4F40   (0x0010)  
	FQuat                                              ___S_0_0_0_0n0_c_R_609;                                     // 0x4F50   (0x0020)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_610;                                     // 0x4F70   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_611;                                     // 0x4F80   (0x000C)  
	unsigned char                                      UnknownData110_6[0x4];                                      // 0x4F8C   (0x0004)  MISSED
	FQuat                                              ___S_0_0_0_0n0_c_R_612;                                     // 0x4F90   (0x0020)  
	double                                             ___S_0_0_0_0n0_c_R_613;                                     // 0x4FB0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_614;                                     // 0x4FB8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_615;                                     // 0x4FC0   (0x0008)  
	bool                                               ___S_0_0_0_0n0_c_R_616;                                     // 0x4FC8   (0x0001)  
	unsigned char                                      UnknownData111_6[0x3];                                      // 0x4FC9   (0x0003)  MISSED
	float                                              ___S_0_0_0_0n0_c_R_617;                                     // 0x4FCC   (0x0004)  
	double                                             ___S_0_0_0_0n0_c_R_618;                                     // 0x4FD0   (0x0008)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n0_c_R_619;                                     // 0x4FD8   (0x0050)  
	double                                             ___S_0_0_0_0n0_c_R_620;                                     // 0x5028   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_621;                                     // 0x5030   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_622;                                     // 0x5038   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_623;                                     // 0x5040   (0x0008)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_;                                                  // 0x5048   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_624;                                               // 0x5098   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_625;                                               // 0x50E8   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_626;                                       // 0x5138   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_627;                                       // 0x5148   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_628;                                       // 0x5158   (0x0010)  
	SDK_UNDEFINED(16,1244) /* TArray<TArray<FCachedRigElement>> */ __um(__n0_V_____0___Q_);                        // 0x5168   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_630;                                       // 0x5178   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_631;                                       // 0x5188   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_632;                                       // 0x5198   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_633;                                       // 0x51A8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_634;                                       // 0x51B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_635;                                       // 0x51C8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_636;                                       // 0x51D8   (0x0010)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_637;                                               // 0x51E8   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_638;                                               // 0x5238   (0x0050)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_639;                                       // 0x5288   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_640;                                       // 0x5298   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_641;                                       // 0x52A8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_642;                                       // 0x52B8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_643;                                       // 0x52C8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_644;                                       // 0x52D8   (0x0010)  
	TArray<FCachedRigElement>                          __n0_V_____0___Q_645;                                       // 0x52E8   (0x0010)  
	TArray<bool>                                       __n0_V_____0___Q_646;                                       // 0x52F8   (0x0010)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_647;                                               // 0x5308   (0x0050)  
	FRigVMInstructionSetExecuteState                   ___S_0_0_648;                                               // 0x5358   (0x0050)  
	float                                              ___S_0_0_0_0n0_c_R_649;                                     // 0x53A8   (0x0004)  
	unsigned char                                      UnknownData112_6[0x4];                                      // 0x53AC   (0x0004)  MISSED
	FRigVMInstructionSetExecuteState                   ___S_0_0_0_0n;                                              // 0x53B0   (0x0050)  
	FRuntimeFloatCurve                                 ___S_0_0_0_0n0_c_R_650;                                     // 0x5400   (0x0088)  
	double                                             ___S_0_0_0_0n0_c_R_651;                                     // 0x5488   (0x0008)  
	float                                              ___S_0_0_0_0n0_c_R_652;                                     // 0x5490   (0x0004)  
	unsigned char                                      UnknownData113_6[0x4];                                      // 0x5494   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_653;                                     // 0x5498   (0x0008)  
	float                                              ___S_0_0_0_0n0_c_R_654;                                     // 0x54A0   (0x0004)  
	unsigned char                                      UnknownData114_6[0x4];                                      // 0x54A4   (0x0004)  MISSED
	double                                             ___S_0_0_0_0n0_c_R_655;                                     // 0x54A8   (0x0008)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_656;                                 // 0x54B0   (0x0010)  
	TArray<FCachedRigElement>                          p_n0_V__k0_0_0_____b6R_657;                                 // 0x54C0   (0x0010)  
	FVector                                            ___S_0_0_0_0n0_c_R_658;                                     // 0x54D0   (0x0018)  
	double                                             ___S_0_0_0_0n0_c_R_659;                                     // 0x54E8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_660;                                     // 0x54F0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_661;                                     // 0x54F8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_662;                                     // 0x5500   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_663;                                     // 0x5508   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_664;                                     // 0x5510   (0x0018)  
	unsigned char                                      UnknownData115_6[0x8];                                      // 0x5528   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_665;                                     // 0x5530   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_666;                                     // 0x5590   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_667;                                     // 0x55A0   (0x000C)  
	unsigned char                                      UnknownData116_6[0x4];                                      // 0x55AC   (0x0004)  MISSED
	FQuat                                              ___S_0_0_0_0n0_c_R_668;                                     // 0x55B0   (0x0020)  
	double                                             ___S_0_0_0_0n0_c_R_669;                                     // 0x55D0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_670;                                     // 0x55D8   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_671;                                     // 0x55E0   (0x0008)  
	double                                             ___S_0_0_0_0n0_c_R_672;                                     // 0x55E8   (0x0008)  
	FVector                                            ___S_0_0_0_0n0_c_R_673;                                     // 0x55F0   (0x0018)  
	unsigned char                                      UnknownData117_6[0x8];                                      // 0x5608   (0x0008)  MISSED
	FTransform                                         ___S_0_0_0_0n0_c_R_674;                                     // 0x5610   (0x0060)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_675;                                     // 0x5670   (0x0010)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_676;                                     // 0x5680   (0x000C)  
	unsigned char                                      UnknownData118_6[0x4];                                      // 0x568C   (0x0004)  MISSED
	TArray<FConstraintParent>                          ___S_0_0_0_0n0_c_R_677;                                     // 0x5690   (0x0010)  
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_678;                                     // 0x56A0   (0x0010)  
	SDK_UNDEFINED(16,1245) /* TArray<TArray<FCachedRigElement>> */ __um(___S_0_0_0_0n0_c_R_);                      // 0x56B0   (0x0010)  
	FTransform                                         ___S_0_0_0_0n0_c_R_680;                                     // 0x56C0   (0x0060)  
	FRigElementKey                                     ___S_0_0_0_0n0_c_R_681;                                     // 0x5720   (0x000C)  
	unsigned char                                      UnknownData119_6[0x4];                                      // 0x572C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          ___S_0_0_0_0n0_c_R_682;                                     // 0x5730   (0x0010)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x5740   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x5748   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x5750   (0x0008)  
	FName                                              RigVMModel_Rig_2___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x5758   (0x0008)  
};

#pragma pack(pop)


